src/tests/load/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load phase"
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Peak load phase"
  environments:
    production:
      target: "https://api.example.com"
      phases:
        - duration: 300
          arrivalRate: 10
          rampTo: 100
          name: "Production load test"
  plugins:
    metrics-by-endpoint: {}
  processor: "./load-test-functions.js"

scenarios:
  - name: "API endpoints"
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
      
      - think: 1
      
      - get:
          url: "/api/users"
          headers:
            Authorization: "Bearer {{ $processEnvironment.API_TOKEN }}"
          expect:
            - statusCode: 200
      
      - think: 2
      
      - post:
          url: "/api/users"
          headers:
            Authorization: "Bearer {{ $processEnvironment.API_TOKEN }}"
          json:
            name: "Test User"
            email: "{{ $randomEmail() }}"
            role: "user"
          expect:
            - statusCode: 201
            - hasProperty: "id"
      
      - think: 1
      
      - get:
          url: "/api/products"
          expect:
            - statusCode: 200
      
      - function: "selectRandomProduct"
      
      - get:
          url: "/api/products/{{ productId }}"
          expect:
            - statusCode: 200
            - hasProperty: "name"
            - hasProperty: "price"